#+TITLE: Testing Code
#+REVEAL_THEME: dracula
#+REVEAL_PLUGINS: (highlight)
#+REVEAL_EXTRA_SCRIPTS: ("https://code.jquery.com/jquery-3.7.1.min.js" "https://www.xn--4-cmb.com/rpoll/poll.js" "https://cdn.jsdelivr.net/npm/reveal.js-plugins@latest/audio-slideshow/plugin.js" "https://cdn.jsdelivr.net/npm/reveal.js-plugins@latest/audio-slideshow/recorder.js" "https://cdnjs.cloudflare.com/ajax/libs/RecordRTC/5.6.2/RecordRTC.js" "https://cdn.jsdelivr.net/npm/reveal.js-plugins@latest/anything/plugin.js" "https://cdn.jsdelivr.net/npm/reveal.js-plugins@latest/customcontrols/plugin.js")
#+REVEAL_EXTRA_CSS: https://www.xn--4-cmb.com/rpoll/poll.css
#+REVEAL_HIGHLIGHT_CSS_IGNORE: reveal.js/plugin/highlight/monokai.css
#+PROPERTY: HEADER-ARGS+ :eval no-export
#+OPTIONS:  toc:nil
#+PROPERTY: header-args :exports both :eval no-export

** Example
#+NAME: bash-lunaid-1
#+begin_src bash :tangle testing-code/lunaid.bash :eval never
# lunaid.bash
lunaid() { echo "$*" | grep -Po '\d{5}'; }
eval "$(iffmain lunaid)" # lncdtool callback
#+end_src

#+begin_src bash :tangle testing-code/lunaid_1.bats :eval never
# lunaid_1.bats
source lunaid.bash
lunaid_test() { # @test
    run lunaid sub-12345
    [[ $output == 12345 ]]
}
#+end_src

#+begin_src bash :dir testing-code/ :results output verbatim
bats lunaid_1.bats
#+end_src

#+RESULTS:
: 1..1
: ok 1 lunaid_test

*** testthat
#+begin_src R :eval never
score_uppsp <- function(raw_uppspd_df) {
   # ...
   return(scores_df)
}

testthat::expect_equal(
            score_uppsp(read.csv("example_visit.csv"))$tot,
            10)
#+end_src

#+RESULTS:
: Error: "-10" not equal to "10".
: 1/1 mismatches
: x[1]: "-10"
: y[1]: "10"

